In [14]:
# Import packages
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [15]:
# Import first dataset
combined_sparta_day_test_score = pd.read_csv('csv_files/combined_sparta_day_test_score.csv', sep=',', header='infer')
combined_sparta_day_test_score.head()

,Date,Academy,Name,Psychometrics,Presentation
0,Thursday 1 August 2019,Birmingham Academy,HILARY WILLMORE,51,19
1,Thursday 1 August 2019,Birmingham Academy,ORLY LORENS,51,19
2,Thursday 1 August 2019,Birmingham Academy,ALVIE BLEACKLY,55,16
3,Thursday 1 August 2019,Birmingham Academy,DECK ITZCHAKI,59,21
4,Thursday 1 August 2019,Birmingham Academy,WILT PENRITT,66,25

In [16]:
combined_sparta_day_test_score.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4134 entries, 0 to 4133
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           4134 non-null   object
 1   Academy        4134 non-null   object
 2   Name           4134 non-null   object
 3   Psychometrics  4134 non-null   int64
 4   Presentation   4134 non-null   int64
dtypes: int64(2), object(3)
memory usage: 161.6+ KB

In [17]:
combined_sparta_day_test_score.describe()

       Psychometrics  Presentation
count    4134.000000   4134.000000
mean       54.827044     20.044025
std         6.675452      3.453748
min        32.000000      8.000000
25%        50.000000     18.000000
50%        55.000000     20.000000
75%        59.000000     23.000000
max        79.000000     30.000000

In [18]:
combined_sparta_day_test_score.isnull()

       Date  Academy   Name  Psychometrics  Presentation
0     False    False  False          False         False
1     False    False  False          False         False
2     False    False  False          False         False
3     False    False  False          False         False
4     False    False  False          False         False
...     ...      ...    ...            ...           ...
4129  False    False  False          False         False
4130  False    False  False          False         False
4131  False    False  False          False         False
4132  False    False  False          False         False
4133  False    False  False          False         False

[4134 rows x 5 columns]

In [19]:
combined_sparta_day_test_score.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
4129    False
4130    False
4131    False
4132    False
4133    False
Length: 4134, dtype: bool

In [20]:
combined_sparta_day_test_score.dtypes

Date             object
Academy          object
Name             object
Psychometrics     int64
Presentation      int64
dtype: object

In [21]:
combined_sparta_day_test_score.Academy.dtype

dtype('O')

In [22]:
combined_sparta_day_test_score["Name"] = combined_sparta_day_test_score["Name"].str.title()

In [23]:
combined_sparta_day_test_score.head()

,Date,Academy,Name,Psychometrics,Presentation
0,Thursday 1 August 2019,Birmingham Academy,Hilary Willmore,51,19
1,Thursday 1 August 2019,Birmingham Academy,Orly Lorens,51,19
2,Thursday 1 August 2019,Birmingham Academy,Alvie Bleackly,55,16
3,Thursday 1 August 2019,Birmingham Academy,Deck Itzchaki,59,21
4,Thursday 1 August 2019,Birmingham Academy,Wilt Penritt,66,25

In [24]:
combined_sparta_day_test_score['Date'] = pd.to_datetime(
    combined_sparta_day_test_score['Date'], 
    format="%A %d %B %Y"
)

In [25]:
combined_sparta_day_test_score.dtypes

Date             datetime64[ns]
Academy                  object
Name                     object
Psychometrics             int64
Presentation              int64
dtype: object

In [27]:
combined_sparta_day_test_score.head()

        Date             Academy             Name  Psychometrics  Presentation
0 2019-08-01  Birmingham Academy  Hilary Willmore             51            19
1 2019-08-01  Birmingham Academy      Orly Lorens             51            19
2 2019-08-01  Birmingham Academy   Alvie Bleackly             55            16
3 2019-08-01  Birmingham Academy    Deck Itzchaki             59            21
4 2019-08-01  Birmingham Academy     Wilt Penritt             66            25

In [30]:
print(combined_sparta_day_test_score['Date'].dt.strftime("%A %d %B %Y"))

0         Thursday 01 August 2019
1         Thursday 01 August 2019
2         Thursday 01 August 2019
3         Thursday 01 August 2019
4         Thursday 01 August 2019
                  ...
4129    Wednesday 09 October 2019
4130    Wednesday 09 October 2019
4131    Wednesday 09 October 2019
4132    Wednesday 09 October 2019
4133    Wednesday 09 October 2019
Name: Date, Length: 4134, dtype: object

In [32]:
combined_sparta_day_test_score.to_csv('combined_sparta_day_test_score.csv')